# Taller de Pandas
Complete los  siguientes ejercicios por pasos que se plantean en este cuaderno usando la libreria Pandas

## Importando pandas

 

**1.** importe pandas usando el alias `pd`.

In [25]:
import pandas as pd

**2.** imprima la version de pandas que ha sido importada.

In [26]:
print(pd.__version__)

1.0.5

## usando DataFrames

### Algunas rutinas para seleccionar, ordenar sumar y añadir datos a  un Dataframe

Nota: recuerde importar numpy usando:
```python
import numpy as np
```

considere el siguente diccionario llamado `data` y la lista llamada `labels`:

``` python
data = {'animal': ['gato', 'gato', 'serpiente', 'perro', 'perro', 'gato', 'serpiente', 'gato', 'perro', 'perro'],
        'edad': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visitas': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'prioridad': ['si', 'si', 'no', 'si', 'no', 'no', 'no', 'si', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(relacion de animales y visitas al veterinario)

**4.** cree un dataframe `df` a partir del diccionario `data` con los indices de la lista `labels`.

In [27]:
import numpy as np

data = (({'Animal':  ['Gato', 'Gato', 'Serpiente', 'Perro', 'Perro', 'Gato', 'Serpiente', 'Gato', 'Perro', 'Perro'],
        'Edad':      [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'Visitas':   [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'Prioridad': ['Si', 'Si', 'No', 'Si', 'No', 'No', 'No', 'Si', 'No', 'No']}))

labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']
print(data)
df = pd.DataFrame(data, index=labels) # df = (complete esta linea)
df

{'Animal': ['Gato', 'Gato', 'Serpiente', 'Perro', 'Perro', 'Gato', 'Serpiente', 'Gato', 'Perro', 'Perro'], 'Edad': [2.5, 3, 0.5, nan, 5, 2, 4.5, nan, 7, 3], 'Visitas': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'Prioridad': ['Si', 'Si', 'No', 'Si', 'No', 'No', 'No', 'Si', 'No', 'No']}

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1        Si
B       Gato   3.0        3        Si
C  Serpiente   0.5        2        No
D      Perro   NaN        3        Si
E      Perro   5.0        2        No
F       Gato   2.0        3        No
G  Serpiente   4.5        1        No
H       Gato   NaN        1        Si
I      Perro   7.0        2        No
J      Perro   3.0        1        No

**5.** Muestre un resumen de la información básica sobre este DataFrame y sus datos (*pista: hay un método único al que se puede llamar en el DataFrame*).

In [28]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to J
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Animal     10 non-null     object
 1   Edad       8 non-null      float64
 2   Visitas    10 non-null     int64
 3   Prioridad  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

           Edad    Visitas
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** visualice las primeras 3 filas del DataFrame `df`.

In [29]:
Vi=df.head(3)
Vi

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1        Si
B       Gato   3.0        3        Si
C  Serpiente   0.5        2        No

**7.** Seleccione solo las columnas 'animal' y 'edad' del DataFrame `df`.

In [30]:
SS=df.drop(['Visitas','Prioridad'], axis='columns', inplace=False)
SS

      Animal  Edad
A       Gato   2.5
B       Gato   3.0
C  Serpiente   0.5
D      Perro   NaN
E      Perro   5.0
F       Gato   2.0
G  Serpiente   4.5
H       Gato   NaN
I      Perro   7.0
J      Perro   3.0

**8.** Seleccione los datos en las filas [3, 4, 8]   en las columnas ['animal', 'edad'].

In [31]:
df.iloc[[3,4,8],[0,2]]

  Animal  Visitas
D  Perro        3
E  Perro        2
I  Perro        2

**9.** Seleccione solo las filas en las que el número de visitas sea superior a 3.

In [32]:
df[df['Visitas']>=3]

  Animal  Edad  Visitas Prioridad
B   Gato   3.0        3        Si
D  Perro   NaN        3        Si
F   Gato   2.0        3        No

**10.** Seleccione las filas donde falta la edad, es decir, es `NaN`.

In [33]:
SF=df[pd.isnull(df['Edad'])]['Edad']
SF

D   NaN
H   NaN
Name: Edad, dtype: float64

**11.** Seleccione las filas donde el animal es un gato *y* la edad es menor de 3.

In [34]:
df[(df.Animal=='Gato') & (df.Edad < 3)]

  Animal  Edad  Visitas Prioridad
A   Gato   2.5        1        Si
F   Gato   2.0        3        No

**12.** Seleccione las filas cuya edad está entre 2 y 4 (inclusive).

In [35]:
df[(df.Edad >= 2) & (df.Edad <= 4)]

  Animal  Edad  Visitas Prioridad
A   Gato   2.5        1        Si
B   Gato   3.0        3        Si
F   Gato   2.0        3        No
J  Perro   3.0        1        No

**13.** Cambie la edad en la fila `f` a 1.5.

In [36]:
#print(df.at['I','Edad']==1.5)
df.loc['F']=['Gato',1.5,3,'No']
df

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1        Si
B       Gato   3.0        3        Si
C  Serpiente   0.5        2        No
D      Perro   NaN        3        Si
E      Perro   5.0        2        No
F       Gato   1.5        3        No
G  Serpiente   4.5        1        No
H       Gato   NaN        1        Si
I      Perro   7.0        2        No
J      Perro   3.0        1        No

**14.** Calcule la suma de todas las visitas en df (es decir, encuentre el número total de visitas).

In [37]:
S=df['Visitas'].sum()
S

19

15. Calcule la edad media de cada animal diferente en `df`.

In [38]:
df.groupby('Animal')['Edad'].mean()

Animal
Gato         2.333333
Perro        5.000000
Serpiente    2.500000
Name: Edad, dtype: float64

**16.** Agrega una nueva fila 'k' a `df` con tu elección de valores para cada columna. Luego elimine esa fila para asi volver al DataFrame original

In [39]:
df.loc['K']=['Leon',4,1,'Si']
print(df)
df.drop(['K'],axis=0)

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1        Si
B       Gato   3.0        3        Si
C  Serpiente   0.5        2        No
D      Perro   NaN        3        Si
E      Perro   5.0        2        No
F       Gato   1.5        3        No
G  Serpiente   4.5        1        No
H       Gato   NaN        1        Si
I      Perro   7.0        2        No
J      Perro   3.0        1        No
K       Leon   4.0        1        Si

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1        Si
B       Gato   3.0        3        Si
C  Serpiente   0.5        2        No
D      Perro   NaN        3        Si
E      Perro   5.0        2        No
F       Gato   1.5        3        No
G  Serpiente   4.5        1        No
H       Gato   NaN        1        Si
I      Perro   7.0        2        No
J      Perro   3.0        1        No

**17.** Cuente el número de cada tipo de animal en `df`.

In [40]:
df['Animal'].value_counts()

Gato         4
Perro        4
Serpiente    2
Leon         1
Name: Animal, dtype: int64

**18.** Ordene `df` primero por los valores en la 'edad' en orden descendente, luego por el valor en la columna 'visitas' en orden ascendente (por lo que la fila `i` debe ser la primera y la fila `d` debe ser la última).

In [41]:
OE=df.sort_values('Edad', ascending=False)
OE
OV=df.sort_values('Visitas', ascending=True)
OV

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1        Si
G  Serpiente   4.5        1        No
H       Gato   NaN        1        Si
J      Perro   3.0        1        No
K       Leon   4.0        1        Si
C  Serpiente   0.5        2        No
E      Perro   5.0        2        No
I      Perro   7.0        2        No
B       Gato   3.0        3        Si
D      Perro   NaN        3        Si
F       Gato   1.5        3        No

**19.** La columna 'prioridad' contiene los valores 'sí' y 'no'. Reemplace esta columna con una columna de valores booleanos: 'sí' debe ser `True` y 'no' debe ser `False`.

In [42]:
R=df.replace({'Si' : 'True','No':'False'})
R

      Animal  Edad  Visitas Prioridad
A       Gato   2.5        1      True
B       Gato   3.0        3      True
C  Serpiente   0.5        2     False
D      Perro   NaN        3      True
E      Perro   5.0        2     False
F       Gato   1.5        3     False
G  Serpiente   4.5        1     False
H       Gato   NaN        1      True
I      Perro   7.0        2     False
J      Perro   3.0        1     False
K       Leon   4.0        1      True

**20.** En la columna 'animal', cambie las entradas de 'serpiente' a 'python'..

In [43]:
C=df.replace({'Serpiente':'Python'})
C

   Animal  Edad  Visitas Prioridad
A    Gato   2.5        1        Si
B    Gato   3.0        3        Si
C  Python   0.5        2        No
D   Perro   NaN        3        Si
E   Perro   5.0        2        No
F    Gato   1.5        3        No
G  Python   4.5        1        No
H    Gato   NaN        1        Si
I   Perro   7.0        2        No
J   Perro   3.0        1        No
K    Leon   4.0        1        Si

**21.** Para cada tipo de animal y cada número de visitas, encuentre la edad media. En otras palabras, cada fila es un animal, cada columna es un número de visitas y los valores son las edades medias.

In [45]:
table=pd.pivot_table(df, values='Edad', index='Animal', columns='Visitas', aggfunc=np.sum)
table

Visitas      1     2    3
Animal
Gato       2.5   NaN  4.5
Leon       4.0   NaN  NaN
Perro      3.0  12.0  0.0
Serpiente  4.5   0.5  NaN

###  es posible que deba combinar dos o más métodos para obtener la respuesta correcta

A continuación se muestran algunas formas en las que podría necesitar filtrar los datos, pero para las cuales no existe un método único "listo para usar".

**22.** Se tiene un DataFrame `df` con una columna 'A' de enteros.  
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

¿Cómo se filtran las filas que contienen el mismo número entero que la fila inmediatamente superior?

Debería quedarse con una columna que contiene los siguientes valores:

```python
1, 2, 3, 4, 5, 6, 7
```

In [46]:
dfD = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
dfD.drop_duplicates(subset='A')

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**23.** Dado un DataFrame de valores numéricos:
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # tabla de valores reales de 5x3  
```

¿Cómo se resta la media de la fila de cada elemento de la fila?

In [49]:
RM= pd.DataFrame(np.random.random(size=(5, 3))) # tabla de valores reales de 5x3
print(RM)
RM.sub(RM.mean(axis=1), axis=0)

          0         1         2
0  0.187312  0.474149  0.948600
1  0.701366  0.709741  0.610586
2  0.266268  0.793158  0.117345
3  0.169501  0.227588  0.077213
4  0.829497  0.693481  0.676970

          0         1         2
0 -0.349375 -0.062538  0.411913
1  0.027468  0.035843 -0.063311
2 -0.125989  0.400901 -0.274912
3  0.011401  0.069487 -0.080888
4  0.096181 -0.039835 -0.056346

**24.** Suponga que tiene DataFrame con 10 columnas de números reales, por ejemplo:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```

¿Qué columna de números tiene la suma más pequeña? Devuelva la etiqueta de esa columna.

In [50]:
SP = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
print(SP)
suma=list()
suma=SP.apply(np.sum, axis=0)
print(suma)
suma.min()

          a         b         c         d         e         f         g  \
0  0.130860  0.833937  0.995257  0.511842  0.706322  0.663525  0.012797
1  0.735726  0.976660  0.397888  0.381941  0.554180  0.710240  0.316480
2  0.854992  0.746269  0.498819  0.531718  0.248348  0.586186  0.971038
3  0.420790  0.379709  0.178920  0.206357  0.926308  0.707525  0.970140
4  0.984965  0.617428  0.316490  0.341416  0.923771  0.784427  0.805145

          h         i         j
0  0.376315  0.527267  0.995389
1  0.964909  0.749427  0.643575
2  0.155485  0.867870  0.070202
3  0.482726  0.021046  0.893065
4  0.281398  0.019731  0.227996
a    3.127333
b    3.554003
c    2.387374
d    1.973274
e    3.358928
f    3.451902
g    3.075600
h    2.260835
i    2.185341
j    2.830227
dtype: float64

1.9732743606341212

**25.** ¿Cómo se cuenta cuántas filas únicas tiene un DataFrame (es decir, ignora todas las filas que están duplicadas)? Como entrada, use un DataFrame de ceros y unos con 10 filas y 3 columnas.

```python
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
```

In [51]:
FU = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
print(FU)
FU.iloc[[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]].drop_duplicates()

   0  1  2
0  0  1  1
1  1  0  1
2  1  1  1
3  0  0  1
4  0  0  0
5  0  0  0
6  0  0  0
7  0  0  0
8  1  0  0
9  1  1  1

   0  1  2
0  0  1  1
1  1  0  1
2  1  1  1
3  0  0  1
4  0  0  0
8  1  0  0

**26.** En la celda a continuación, se tiene un DataFrame `df` que consta de 10 columnas de números reales. De esos exactamente   5 entradas en cada fila son valores de NaN. 

Para cada fila del DataFrame, busque la columna que contiene el tercer valor de NaN.

Debe devolver una columna de etiquetas de la forma: `e, c, d, h, d`

In [23]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columnas = list('abcdefghij')

df = pd.DataFrame(data, columns=columnas)
print(df)
df1=df.isnull().cumsum(axis=1)
print(df1)
(df.isnull().cumsum(axis=1)==3).idxmax(axis=1)

# write a solution to the question here

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68
   a  b  c  d  e  f  g  h  i  j
0  0  1  2  2  3  3  3  3  4  5
1  1  2  3  3  3  4  5  5  5  5
2  1  2  2  3  3  3  4  5  5  5
3  0  1  2  2  2  2  2  3  4  5
4  1  2  2  3  3  4  4  5  5  5

0    e
1    c
2    d
3    h
4    d
dtype: object

**27.** Implemente una media móvil el grupos con tamaño de ventana 3, que ignora el valor de NaN. Por ejemplo, considere el siguiente DataFrame::

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
se debe calcular el filtro y obtener estos valores

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
P.ej. la primera ventana de tamaño tres para el grupo 'b' tiene valores 3.0, NaN y 3.0 y ocurre en el índice de fila 5. En lugar de ser NaN, el valor en la nueva columna en este índice de fila debe ser 3.0 (solo los dos valores que no son NaN se utilizan para calcular la media (3 + 3) / 2)

In [24]:
df = pd.DataFrame({'Group': list('aabbabbbabab'),
                       'Value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
df1=df.groupby(['Group'])['Value']
v=df.fillna(0).groupby(['Group'])['Value']
v1=v.rolling(3, min_periods=1).sum()/ df1.rolling(3, min_periods=1).count()
v1
v1.reset_index(level=0, drop=True).sort_index()

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: Value, dtype: float64